import numpy as np

print('-------- 整数数组索引 ---------')
x = np.array([
    [1, 2],
    [3, 4],
    [5, 6]
    ])
y = x[[0, 1, 2],  # 获取 (0,0) (1,1) (2,0)
      [0, 1, 0]]   
print(y, '\n')

x = np.array([
    [  0,  1,  2],
    [  3,  4,  5],
    [  6,  7,  8],
    [  9,  10,  11]
    ])  
y = x[[[0,0],[3,3]],    # 获取 (0,0) (0,2) (3,0) (3,2) 
      [[0,2],[0,2]]]    # 返回 2*2 的数组
print(y, '\n')

a = np.array([
    [1, 2, 3], 
    [4, 5, 6],
    [7, 8, 9]
    ])
b = a[1:3, 1:3]
c = a[1:3, [1, 2]] # 1:3 是1到2行；[1,2]是2、3列
d = a[..., 1:]
print(b)
print(c)
print(d)

# 总结:
#   a[行，列]
#   1:3       (1 到 3)
#   [1,3]     (1 和 3)

print('-------- 布尔索引 ---------')
x = np.array([[  0,  1,  2],
              [  3,  4,  5],
              [  6,  np.nan,  8],
              [  9,  10,  11]
              ])  
print(x [x > 5])    # 打印出大于5的元素
print(x [~np.isnan(x)])     # 过滤 NaN
print(x [np.iscomplex(x)])   # 过滤非复数

print('-------- 花式索引 ---------')
# 利用整数数组进行索引
x = np.arange(9)    # 一维数组
print(x)
x2 = x[[0, 6, 7]]
print(x2)

x = np.arange(32).reshape((8, 4))   # 二维数组
print(x)
print(x[[4, 2, 1, 7]]) # 输出对应行


# 后面还有一些内容
